# coding=utf-8
# ===============================================================================
# @ Creator:zhn
# @ Date:2015-9-21
# python编程练习---内置函数练习
# ===============================================================================


class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age

    def show(self):
        if hasattr(self, 'name'):
            print self.name
        if hasattr(self, 'age'):
            print self.age

tom = Person('all', 12)


def add_num(x, y):
    return x+y


def func(a):
    if a < 10:
        return a
# ----------------------apply-------------------------------
# print apply(add_num, (1, 3)) # 用于执行函数
# ----------------------------------------------------------
# ----------------------filter------------------------------
# print filter(func, range(1, 100)) # 按条件过滤对象
# ----------------------------------------------------------
# ----------------------reduce------------------------------
# 序列元素连续处理
# print reduce(add_num, range(0, 10)), reduce(add_num, range(0, 10), 10), reduce(add_num, range(0, 0), 10)
# ----------------------------------------------------------
# ----------------------map---------------------------------
# print map(add_num, range(0, 10), range(0, 10)) # 多序列元素相同处理
# ----------------------------------------------------------
# ----------------------bool--------------------------------
# print bool(1+1 == 3) # 将表达式转换为bool值
# ----------------------------------------------------------
# ----------------------cmp---------------------------------
# print cmp(3, 3) # 比较大小
# ----------------------------------------------------------
# -----------------------hasattr----------------------------
# 删除对象属性
# tom.show()
# print '==================delete==========================='
# hasattr(tom, "age")
# tom.show()
# ----------------------------------------------------------

# print reduce(lambda x, y: x+y, range(1, 6))

#
# def next_item(a):
#     for item in a:
#         yield item
# r = next_item((1, 2, 3))
# print r.next()


