# -*- coding: utf-8 -*-
# ===============================================================================
# @ Creator：zhn
# @ Date:2016-11-09
# 民生项目金证系统生成ta文件--索引文件
# ===============================================================================
ta_name_need = [
    '华润远大基金',
    '国投瑞银基金'
]

date = '20170223'

ta_code_dir = {
    '国泰基金': '02',
    '嘉实基金': '07',
    '泰信基金': '29',
    '深证登记': '98',
    '富国基金': '20',
    '融通基金': '16',
    '南方基金': '01',
    '上海登记': '99',
    '民生加银': '69',
    '汇添富基金': '47',
    '鹏华基金': '06',
    '华富基金': '41',
    '诺德基金': '57',
    '华安基金': '04',
    '华夏基金': '03',
    '诺安基金': '32',
    '泰达宏利': '22',
    '长城基金': '20',
    '摩根基金': '33',
    '金鹰基金': '21',
    '国投瑞银基金': '12',
    '银河基金': '15',
    '建信基金': '53',
    '宝盈基金': '13',
    '天弘基金': '42',
    '华宝兴业基金': '24',
    '华商基金': '63',
    '招商基金': '17',
    '景顺长城基金': '26',
    '中邮基金': '59',
    '浙商基金': '68',
    '长盛基金': '20',
    '大成基金': '09',
    '益民基金': '56',
    '博时基金': '05',
    '泓德基金': '4D',
    '银华基金': '18',
    '前海开源基金': '44',
    '财通基金': '72',
    '华润远大基金': '0A',
    '江信基金': '0C'
}

receiver = '620'
